<a href="https://colab.research.google.com/github/seldoncode/tutorial/blob/main/tutorial_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQL MASTERY: THE COMPLETE TUTORIAL**

## **PART 1: SQL FOUNDATIONS**

---

## **1.1 WHAT IS SQL AND WHY LEARN IT?**

### **Understanding SQL**

**SQL (Structured Query Language)** is the standard programming language specifically designed for managing and manipulating **relational databases**. Since its creation in the 1970s by IBM researchers, SQL has become the fundamental tool for anyone working with data, including:

- **Software Developers** - Building data-driven applications
- **Data Analysts** - Extracting insights from data
- **Database Administrators** - Managing and optimizing databases
- **Business Intelligence Professionals** - Creating reports and dashboards
- **Data Scientists** - Preparing and analyzing datasets

### **The Power of SQL**

SQL empowers you to:
- **Retrieve** specific data from massive datasets
- **Insert, update, and delete** records with precision
- **Create and modify** database structures
- **Control access** to sensitive data
- **Ensure data integrity** through constraints and transactions
- **Combine data** from multiple sources intelligently

### **Real-World Applications**

SQL is everywhere:
- **E-commerce** - Customer orders, inventory management
- **Banking** - Transaction processing, account management
- **Healthcare** - Patient records, treatment histories
- **Social Media** - User profiles, connections, content
- **Logistics** - Shipment tracking, inventory control

```sql
-- Simple example: Finding customers in New York
SELECT first_name, last_name, email
FROM customers
WHERE city = 'New York'
ORDER BY last_name;
```

---

## **1.2 RELATIONAL DATABASE CONCEPTS**

### **The Relational Model**

A **relational database** organizes data into **tables** (also called relations) that consist of **rows** (records) and **columns** (fields). This structure provides a logical and efficient way to store and retrieve data.

### **Core Components**

1. **Tables** - Collections of related data
2. **Rows** - Individual records in a table
3. **Columns** - Attributes or fields of the data
4. **Primary Keys** - Unique identifiers for each row
5. **Foreign Keys** - References to primary keys in other tables
6. **Relationships** - Connections between tables

### **Visualizing the Structure**

```
DATABASE: Company_System
    |
    ├── TABLE: employees
    │   ├── id (Primary Key)
    │   ├── first_name
    │   ├── last_name
    │   ├── email
    │   ├── department_id (Foreign Key)
    │   └── hire_date
    │
    ├── TABLE: departments
    │   ├── id (Primary Key)
    │   ├── name
    │   ├── location
    │   └── manager_id
    │
    └── TABLE: projects
        ├── id (Primary Key)
        ├── name
        ├── start_date
        ├── end_date
        └── budget
```

### **Key Database Concepts**

- **Data Integrity** - Ensuring accuracy and consistency
- **Normalization** - Organizing data to minimize redundancy
- **ACID Properties** - Atomicity, Consistency, Isolation, Durability
- **Indexes** - Structures that improve query performance
- **Transactions** - Groups of operations that succeed or fail together

---

## **1.3 COMMON DATABASE MANAGEMENT SYSTEMS (DBMS)**

### **Popular SQL Database Systems**

| Database | Company | Best For | License |
|----------|---------|----------|---------|
| **MySQL** | Oracle | Web applications, general purpose | Open Source / Commercial |
| **PostgreSQL** | Community | Complex queries, data integrity | Open Source |
| **SQL Server** | Microsoft | Enterprise applications, Windows | Commercial |
| **SQLite** | Community | Mobile apps, embedded systems | Open Source |
| **Oracle DB** | Oracle | Large enterprises, mission-critical | Commercial |

### **Choosing the Right Database**

Consider these factors:
1. **Project Size** - Small projects vs enterprise systems
2. **Performance Needs** - Read-heavy vs write-heavy workloads
3. **Budget** - Open source vs commercial solutions
4. **Team Expertise** - Existing skills and experience
5. **Scalability** - Future growth requirements
6. **Features Needed** - Advanced analytics, JSON support, etc.

### **SQL: The Common Language**

```sql
-- This basic SELECT works in ALL major databases
SELECT * FROM customers WHERE country = 'USA';

-- Most SQL is standard across databases
INSERT INTO orders (customer_id, amount) VALUES (123, 99.99);
UPDATE products SET price = price * 1.1 WHERE category = 'Electronics';
DELETE FROM log_entries WHERE date < '2023-01-01';
```

---

## **1.4 OUR EXAMPLE DATABASE: COMPANY MANAGEMENT SYSTEM**

Throughout this tutorial, we'll use a **Company Management System** database to illustrate concepts with practical examples. This realistic scenario helps you understand how SQL works in real-world applications.

### **Database Schema Overview**

```sql
-- Main tables in our example database
-- Employees table - Stores employee information
CREATE TABLE employees (
    id INT PRIMARY KEY AUTO_INCREMENT,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    phone VARCHAR(20),
    hire_date DATE NOT NULL,
    salary DECIMAL(10,2),
    department_id INT,
    manager_id INT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

-- Departments table - Company organizational structure
CREATE TABLE departments (
    id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(100) NOT NULL,
    location VARCHAR(200),
    budget DECIMAL(12,2) DEFAULT 0.00,
    manager_id INT
);

-- Projects table - Tracking company initiatives
CREATE TABLE projects (
    id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(200) NOT NULL,
    description TEXT,
    start_date DATE,
    end_date DATE,
    budget DECIMAL(12,2),
    status ENUM('Planning', 'Active', 'Completed', 'On Hold') DEFAULT 'Planning'
);

-- Project assignments - Many-to-many relationship
CREATE TABLE project_assignments (
    employee_id INT,
    project_id INT,
    role VARCHAR(50),
    hours_assigned INT,
    PRIMARY KEY (employee_id, project_id)
);
```

### **Sample Data Preview**

**Employees Table:**
```
id | first_name | last_name | email | department_id | salary
---|------------|-----------|-------|---------------|--------
1  | John       | Smith     | john.smith@company.com | 1 | 65000.00
2  | Sarah      | Johnson   | sarah.j@company.com    | 2 | 72000.00
3  | Michael    | Chen      | michael.c@company.com  | 1 | 58000.00
```

**Departments Table:**
```
id | name       | location      | budget
---|------------|---------------|-----------
1  | Sales      | New York      | 500000.00
2  | Engineering| San Francisco | 800000.00
3  | Marketing  | Chicago       | 300000.00
```

**Relationships:**
- Employees belong to Departments (department_id)
- Employees can work on multiple Projects (project_assignments)
- Departments have budgets and locations
- Projects have timelines and statuses

---

## **1.5 SETTING UP YOUR SQL ENVIRONMENT**

### **Option 1: Online SQL Playgrounds (Quick Start)**

**No installation required:**
- [SQL Fiddle](http://sqlfiddle.com/) - Test SQL online
- [DB Fiddle](https://www.db-fiddle.com/) - Multiple database support
- [W3Schools SQL Tryit](https://www.w3schools.com/sql/trysql.asp) - Simple online editor

### **Option 2: Install a Database Locally**

**SQLite (Simplest):**
```bash
# No server needed, single file database
# Download from: https://www.sqlite.org/download.html
# Or use command line:
sqlite3 company.db  # Creates/opens database file
```

**MySQL:**
```bash
# Windows: Download MySQL Installer
# Mac: brew install mysql
# Linux: sudo apt-get install mysql-server

# Start MySQL service
mysql -u root -p
```

**PostgreSQL:**
```bash
# Windows: Download PostgreSQL installer
# Mac: brew install postgresql
# Linux: sudo apt-get install postgresql

# Start PostgreSQL
psql -U postgres
```

### **Option 3: Database Management Tools**

**Popular GUI Tools:**
1. **MySQL Workbench** - Official MySQL GUI
2. **pgAdmin** - PostgreSQL administration tool
3. **DBeaver** - Universal database tool (supports all databases)
4. **TablePlus** - Modern, native database client
5. **HeidiSQL** - Lightweight MySQL client

### **Creating Our Example Database**

```sql
-- Step 1: Create the database
CREATE DATABASE company_db;

-- Step 2: Use the database
USE company_db;  -- In MySQL
-- In PostgreSQL: \c company_db
-- In SQLite: .open company.db

-- Step 3: Create tables (as shown in section 1.4)

-- Step 4: Insert sample data
INSERT INTO departments (name, location, budget) VALUES
('Sales', 'New York', 500000.00),
('Engineering', 'San Francisco', 800000.00),
('Marketing', 'Chicago', 300000.00),
('Human Resources', 'Boston', 250000.00);

INSERT INTO employees (first_name, last_name, email, hire_date, salary, department_id) VALUES
('John', 'Smith', 'john.smith@company.com', '2020-03-15', 65000.00, 1),
('Sarah', 'Johnson', 'sarah.j@company.com', '2019-07-22', 72000.00, 2),
('Michael', 'Chen', 'michael.c@company.com', '2021-01-10', 58000.00, 1),
('Emily', 'Davis', 'emily.d@company.com', '2018-11-05', 81000.00, 2),
('David', 'Wilson', 'david.w@company.com', '2022-06-30', 55000.00, 3);
```

---

## **1.6 BASIC SQL SYNTAX RULES**

### **SQL Statement Structure**

Every SQL statement follows this basic pattern:
```sql
COMMAND column1, column2, ...
FROM table_name
WHERE conditions
GROUP BY columns
HAVING group_conditions
ORDER BY columns
LIMIT number;
```

### **SQL Syntax Rules**

1. **SQL is (mostly) case-insensitive for keywords**
   ```sql
   SELECT * FROM employees;  -- Correct
   select * from employees;  -- Also correct
   Select * From Employees;  -- Works but not conventional
   ```

2. **Use semicolons to separate statements**
   ```sql
   SELECT * FROM employees; SELECT * FROM departments;
   -- Or on separate lines:
   SELECT * FROM employees;
   SELECT * FROM departments;
   ```

3. **String values require single quotes**
   ```sql
   SELECT * FROM employees WHERE last_name = 'Smith';  -- Correct
   SELECT * FROM employees WHERE last_name = "Smith";  -- Wrong in standard SQL
   ```

4. **Numeric values don't need quotes**
   ```sql
   SELECT * FROM employees WHERE salary > 50000;  -- Correct
   SELECT * FROM employees WHERE salary > '50000';  -- Works but not optimal
   ```

5. **White space is generally ignored**
   ```sql
   SELECT * FROM employees WHERE salary > 50000;
   
   -- Same as:
   SELECT *
   FROM employees
   WHERE salary > 50000;
   ```

### **Common SQL Commands Categories**

| Category | Purpose | Common Commands |
|----------|---------|-----------------|
| **DDL** (Data Definition) | Define/modify database structure | CREATE, ALTER, DROP, TRUNCATE |
| **DML** (Data Manipulation) | Manipulate data | SELECT, INSERT, UPDATE, DELETE |
| **DCL** (Data Control) | Control access | GRANT, REVOKE |
| **TCL** (Transaction Control) | Manage transactions | COMMIT, ROLLBACK, SAVEPOINT |

### **Writing Readable SQL Code**

```sql
-- ❌ Hard to read
SELECT e.first_name,e.last_name,d.name FROM employees e,departments d WHERE e.department_id=d.id AND e.salary>50000 ORDER BY e.last_name;

-- ✅ Much better: Proper formatting
SELECT
    e.first_name,
    e.last_name,
    d.name AS department_name
FROM employees e
INNER JOIN departments d ON e.department_id = d.id
WHERE e.salary > 50000
ORDER BY e.last_name;
```

**Formatting Guidelines:**
- Capitalize SQL keywords (SELECT, FROM, WHERE)
- Use lowercase for table/column names
- Indent consistently (typically 4 spaces)
- Break long queries into multiple lines
- Use meaningful aliases
- Add comments for complex logic

---

## **1.7 YOUR FIRST SQL QUERIES**

### **Connecting to the Database**

```bash
# MySQL command line
mysql -u username -p database_name

# PostgreSQL command line
psql -U username -d database_name

# SQLite command line
sqlite3 database_name.db
```

### **Basic Exploration Commands**

```sql
-- List all tables in the database
SHOW TABLES;  -- MySQL
\dt           -- PostgreSQL
.tables       -- SQLite

-- View table structure
DESCRIBE employees;   -- MySQL
\d employees;         -- PostgreSQL
.schema employees;    -- SQLite

-- See database information
SELECT DATABASE();    -- Current database (MySQL)
SELECT current_user;  -- Current user (PostgreSQL)
```

### **Simple SELECT Queries**

```sql
-- 1. Select everything from a table
SELECT * FROM employees;

-- 2. Select specific columns
SELECT first_name, last_name, email FROM employees;

-- 3. Limit number of rows returned
SELECT * FROM employees LIMIT 5;

-- 4. Count total records
SELECT COUNT(*) FROM employees;

-- 5. See unique values in a column
SELECT DISTINCT department_id FROM employees;
```

### **Practice Exercises**

```sql
-- Exercise 1: List all department names
SELECT name FROM departments;

-- Exercise 2: Show employee emails and hire dates
SELECT email, hire_date FROM employees;

-- Exercise 3: How many departments exist?
SELECT COUNT(*) AS department_count FROM departments;

-- Exercise 4: Preview projects table (if exists)
SELECT * FROM projects LIMIT 3;
```

---

## **1.8 SQL DATA TYPES FUNDAMENTALS**

### **Why Data Types Matter**

Every column in a SQL table must have a specified **data type** that defines:
- What kind of data can be stored
- How much storage space is needed
- What operations can be performed
- How data is validated

### **Common SQL Data Types**

| Category | Data Type | Description | Example |
|----------|-----------|-------------|---------|
| **Numeric** | INT | Whole numbers | `42`, `-15` |
| | DECIMAL(p,s) | Exact decimal numbers | `99.99`, `123.45` |
| | FLOAT | Approximate floating-point | `3.14159` |
| **Text** | VARCHAR(n) | Variable-length strings | `'Hello'`, `'World'` |
| | CHAR(n) | Fixed-length strings | `'A'`, `'Yes'` |
| | TEXT | Large text blocks | Long descriptions |
| **Date/Time** | DATE | Date only | `'2024-01-15'` |
| | TIME | Time only | `'14:30:00'` |
| | DATETIME | Date and time | `'2024-01-15 14:30:00'` |
| | TIMESTAMP | Automatic timestamp | `CURRENT_TIMESTAMP` |
| **Boolean** | BOOLEAN | True/False values | `TRUE`, `FALSE`, `1`, `0` |
| **Binary** | BLOB | Binary large objects | Images, files |

### **Choosing the Right Data Type**

```sql
-- Good choices for our example database
CREATE TABLE products (
    id INT PRIMARY KEY AUTO_INCREMENT,      -- Whole number ID
    name VARCHAR(200) NOT NULL,             -- Product name (variable length)
    sku CHAR(10) UNIQUE,                    -- Stock code (fixed length)
    description TEXT,                       -- Long description
    price DECIMAL(10,2) NOT NULL,           -- Money (2 decimal places)
    quantity_in_stock INT DEFAULT 0,        -- Whole number count
    is_available BOOLEAN DEFAULT TRUE,      -- True/False flag
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP, -- Auto timestamp
    weight DECIMAL(6,3)                     -- Weight with 3 decimals
);
```

### **Common Data Type Mistakes to Avoid**

```sql
-- ❌ BAD: Using wrong data types
CREATE TABLE bad_example (
    price VARCHAR(50),       -- Should be DECIMAL
    age TEXT,                -- Should be INT
    quantity CHAR(10),       -- Should be INT
    is_active VARCHAR(10)    -- Should be BOOLEAN
);

-- ✅ GOOD: Proper data types
CREATE TABLE good_example (
    price DECIMAL(10,2),     -- Correct for money
    age INT,                 -- Correct for whole numbers
    quantity INT,            -- Correct for counts
    is_active BOOLEAN        -- Correct for flags
);
```

---

## **1.9 PRACTICAL EXERCISES: FOUNDATIONS**

### **Exercise Set 1: Database Exploration**

```sql
-- 1. Connect to your database and list all tables
SHOW TABLES;

-- 2. Describe the structure of the employees table
DESCRIBE employees;

-- 3. Count how many employees are in the database
SELECT COUNT(*) AS total_employees FROM employees;

-- 4. View the first 3 records from departments table
SELECT * FROM departments LIMIT 3;

-- 5. What are the unique locations of departments?
SELECT DISTINCT location FROM departments;
```

### **Exercise Set 2: Basic Queries**

```sql
-- 1. Select only first names and emails of employees
SELECT first_name, email FROM employees;

-- 2. Find all employees hired in 2021 or later
SELECT * FROM employees WHERE hire_date >= '2021-01-01';

-- 3. List departments with budgets over $400,000
SELECT name, budget FROM departments WHERE budget > 400000;

-- 4. Count employees in each department
SELECT department_id, COUNT(*)
FROM employees
GROUP BY department_id;

-- 5. Order employees by salary (highest first)
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC;
```

### **Exercise Set 3: Data Type Practice**

```sql
-- 1. Create a customers table with appropriate data types
CREATE TABLE customers (
    -- Add columns with correct data types
);

-- 2. Insert sample data into your customers table
INSERT INTO customers VALUES
-- Add sample records
;

-- 3. Check the data types you used
DESCRIBE customers;

-- 4. Try inserting invalid data to see error messages
INSERT INTO customers (age) VALUES ('not a number');  -- Should fail if age is INT
```

---

## **1.10 KEY TAKEAWAYS & NEXT STEPS**

### **What You've Learned in Part 1:**

1. ✅ **SQL's purpose** - Managing relational databases
2. ✅ **Database concepts** - Tables, rows, columns, relationships
3. ✅ **Major DBMS options** - MySQL, PostgreSQL, SQL Server, SQLite
4. ✅ **Setting up environment** - Local or online options
5. ✅ **Basic syntax rules** - Case, quotes, semicolons, formatting
6. ✅ **First queries** - SELECT, COUNT, LIMIT
7. ✅ **Data types** - Choosing appropriate types for data

### **Common Beginner Mistakes to Avoid:**

1. **Forgetting semicolons** - Causes errors in multi-statement scripts
2. **Using double quotes for strings** - Standard SQL uses single quotes
3. **SELECT * in production** - Always specify needed columns
4. **Wrong data types** - Leads to storage waste and performance issues
5. **No formatting** - Makes code hard to read and maintain

### **Preparation for Part 2:**

Before moving to Part 2 (Data Querying), ensure you can:
- Connect to a database successfully
- Run basic SELECT queries
- Understand table structures
- Differentiate between data types

### **Recommended Practice:**

```sql
-- Spend 15-30 minutes experimenting:
-- 1. Create a simple table
-- 2. Insert different data types
-- 3. Practice basic SELECT queries
-- 4. Try to break things (then fix them)

-- Example practice session:
CREATE TABLE practice_table (
    id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(100),
    age INT,
    score DECIMAL(5,2),
    is_active BOOLEAN,
    created_date DATE
);

INSERT INTO practice_table (name, age, score, is_active, created_date)
VALUES ('Test User', 25, 95.50, TRUE, '2024-01-15');

SELECT * FROM practice_table;
```

---

## **QUICK REFERENCE: PART 1 COMMANDS**

### **Essential Commands Learned:**

| Command | Purpose | Example |
|---------|---------|---------|
| `SELECT` | Retrieve data | `SELECT * FROM table;` |
| `FROM` | Specify table | `SELECT column FROM table;` |
| `LIMIT` | Restrict rows | `SELECT * FROM table LIMIT 5;` |
| `COUNT()` | Count rows | `SELECT COUNT(*) FROM table;` |
| `DESCRIBE` | Show structure | `DESCRIBE table_name;` |
| `SHOW TABLES` | List tables | `SHOW TABLES;` |
| `CREATE TABLE` | Create table | `CREATE TABLE name (...);` |
| `INSERT INTO` | Add data | `INSERT INTO table VALUES (...);` |

### **Data Types Quick Guide:**

- **Whole numbers**: `INT`, `BIGINT`, `SMALLINT`
- **Decimal numbers**: `DECIMAL(total_digits, decimal_places)`
- **Text**: `VARCHAR(max_length)`, `TEXT` (long)
- **Dates**: `DATE` (YYYY-MM-DD), `DATETIME`, `TIMESTAMP`
- **Boolean**: `BOOLEAN` (TRUE/FALSE or 1/0)

---

**Ready for Part 2?** In the next section, we'll dive deep into **Data Querying** with WHERE clauses, filtering, sorting, and more powerful SELECT statements!

---

*End of Part 1: SQL Foundations*

# **SQL MASTERY: THE COMPLETE TUTORIAL**

## **PART 2: DATA QUERYING FUNDAMENTALS**

---

## **2.1 THE SELECT STATEMENT: RETRIEVING DATA**

### **Understanding SELECT**

The **SELECT** statement is the most fundamental SQL command. It allows you to retrieve data from one or more tables in your database. Think of it as asking questions to your database: "Show me this information from that table."

### **Basic SELECT Syntax**

```sql
SELECT column1, column2, ...
FROM table_name;
```

### **Retrieving All Columns**

```sql
-- Get ALL columns from employees table
SELECT * FROM employees;

-- * means "all columns" - useful for exploration
-- Use with caution in production (can be slow)
```

**Sample Output:**
```
+----+------------+-----------+-------------------------+------------+--------+---------------+------------+---------------------+
| id | first_name | last_name | email                   | hire_date  | salary | department_id | manager_id | created_at          |
+----+------------+-----------+-------------------------+------------+--------+---------------+------------+---------------------+
| 1  | John       | Smith     | john.smith@company.com | 2020-03-15 | 65000  | 1             | NULL       | 2024-01-15 10:30:00 |
| 2  | Sarah      | Johnson   | sarah.j@company.com    | 2019-07-22 | 72000  | 2             | NULL       | 2024-01-15 10:30:00 |
+----+------------+-----------+-------------------------+------------+--------+---------------+------------+---------------------+
```

### **Selecting Specific Columns**

```sql
-- Get only specific columns
SELECT first_name, last_name, email
FROM employees;

-- Multiple columns, separated by commas
SELECT
    first_name,
    last_name,
    email,
    salary,
    hire_date
FROM employees;
```

**Output:**
```
+------------+-----------+-------------------------+--------+------------+
| first_name | last_name | email                   | salary | hire_date  |
+------------+-----------+-------------------------+--------+------------+
| John       | Smith     | john.smith@company.com | 65000  | 2020-03-15 |
| Sarah      | Johnson   | sarah.j@company.com    | 72000  | 2019-07-22 |
+------------+-----------+-------------------------+--------+------------+
```

### **Best Practice: Avoid SELECT ***

```sql
-- ❌ Less efficient: Retrieves ALL columns
SELECT * FROM employees WHERE id = 1;

-- ✅ More efficient: Only needed columns
SELECT first_name, last_name, email, salary
FROM employees
WHERE id = 1;

-- Why avoid SELECT *?
-- 1. Performance: Unnecessary data transfer
-- 2. Maintenance: Schema changes break code
-- 3. Security: Might expose sensitive columns
-- 4. Clarity: Explicit is better than implicit
```

---

## **2.2 COLUMN ALIASES: RENAMING OUTPUT**

### **Using AS for Aliases**

Column aliases give meaningful names to your query results, making them more readable.

```sql
-- Basic alias with AS keyword
SELECT
    first_name AS "First Name",
    last_name AS "Last Name",
    email AS "Email Address"
FROM employees;

-- AS is optional (but recommended for clarity)
SELECT
    first_name "First Name",
    last_name "Last Name"
FROM employees;
```

### **Alias Examples**

```sql
-- Practical alias usage
SELECT
    first_name AS employee_first,
    last_name AS employee_last,
    salary AS annual_salary,
    salary / 12 AS monthly_salary,  -- Calculated column with alias
    CONCAT(first_name, ' ', last_name) AS full_name  -- Function with alias
FROM employees;

-- Aliases with table names (useful in JOINs)
SELECT
    e.first_name AS emp_first,
    e.last_name AS emp_last,
    d.name AS dept_name
FROM employees e
JOIN departments d ON e.department_id = d.id;
```

**Output:**
```
+-------------+------------+----------------+----------------+-------------------+
| emp_first   | emp_last   | dept_name      | annual_salary  | monthly_salary    |
+-------------+------------+----------------+----------------+-------------------+
| John        | Smith      | Sales          | 65000.00       | 5416.67           |
| Sarah       | Johnson    | Engineering    | 72000.00       | 6000.00           |
+-------------+------------+----------------+----------------+-------------------+
```

### **Special Characters in Aliases**

```sql
-- Use quotes for aliases with spaces or special characters
SELECT
    first_name AS "First Name",
    last_name AS "Last Name",
    salary AS "$ Salary",
    hire_date AS "Hire Date (YYYY-MM-DD)"
FROM employees;

-- Without quotes (won't work with spaces)
SELECT first_name AS First Name FROM employees;  -- ERROR!
```

---

## **2.3 THE WHERE CLAUSE: FILTERING DATA**

### **Introduction to WHERE**

The **WHERE** clause filters records based on specified conditions. It's like asking "Show me employees, but only those who meet these criteria."

```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition;
```

### **Comparison Operators**

```sql
-- Equal to
SELECT * FROM employees WHERE department_id = 2;

-- Not equal to (<> or !=)
SELECT * FROM employees WHERE department_id <> 1;
SELECT * FROM employees WHERE department_id != 1;

-- Greater than
SELECT * FROM employees WHERE salary > 70000;

-- Less than
SELECT * FROM employees WHERE salary < 60000;

-- Greater than or equal to
SELECT * FROM employees WHERE salary >= 65000;

-- Less than or equal to
SELECT * FROM employees WHERE salary <= 55000;
```

### **Logical Operators (AND, OR, NOT)**

```sql
-- AND: All conditions must be true
SELECT * FROM employees
WHERE department_id = 2 AND salary > 60000;

-- OR: At least one condition must be true
SELECT * FROM employees
WHERE department_id = 1 OR department_id = 3;

-- NOT: Negates a condition
SELECT * FROM employees
WHERE NOT department_id = 1;

-- Combining AND, OR with parentheses
SELECT * FROM employees
WHERE (department_id = 1 AND salary > 50000)
   OR (department_id = 2 AND salary > 60000);
```

**Order of Operations:**
1. Parentheses `()`
2. NOT
3. AND
4. OR

```sql
-- Without parentheses (AND evaluated before OR)
SELECT * FROM employees
WHERE department_id = 1 OR department_id = 2 AND salary > 70000;
-- Equivalent to: department_id = 1 OR (department_id = 2 AND salary > 70000)

-- With parentheses (explicit grouping)
SELECT * FROM employees
WHERE (department_id = 1 OR department_id = 2) AND salary > 70000;
```

---

## **2.4 SPECIAL FILTERING OPERATORS**

### **IN Operator: Multiple Values**

```sql
-- Check if value is in a list
SELECT * FROM employees
WHERE department_id IN (1, 2, 3);

-- Equivalent to multiple OR conditions
SELECT * FROM employees
WHERE department_id = 1
   OR department_id = 2
   OR department_id = 3;

-- NOT IN: Exclude values
SELECT * FROM employees
WHERE department_id NOT IN (1, 3);
```

### **BETWEEN Operator: Range Filtering**

```sql
-- Inclusive range (includes endpoints)
SELECT * FROM employees
WHERE salary BETWEEN 50000 AND 70000;

-- Equivalent to AND conditions
SELECT * FROM employees
WHERE salary >= 50000 AND salary <= 70000;

-- Date ranges
SELECT * FROM employees
WHERE hire_date BETWEEN '2020-01-01' AND '2021-12-31';

-- NOT BETWEEN: Outside range
SELECT * FROM employees
WHERE salary NOT BETWEEN 40000 AND 80000;
```

### **LIKE Operator: Pattern Matching**

```sql
-- % matches any sequence of characters (including none)
-- _ matches exactly one character

-- Names starting with 'J'
SELECT * FROM employees WHERE first_name LIKE 'J%';

-- Names ending with 'son'
SELECT * FROM employees WHERE last_name LIKE '%son';

-- Names containing 'oh'
SELECT * FROM employees WHERE first_name LIKE '%oh%';

-- Names with 'a' as second letter
SELECT * FROM employees WHERE first_name LIKE '_a%';

-- Exactly 5 letters ending with 'n'
SELECT * FROM employees WHERE first_name LIKE '____n';

-- Email from specific domain
SELECT * FROM employees WHERE email LIKE '%@company.com';

-- NOT LIKE: Exclude pattern
SELECT * FROM employees WHERE email NOT LIKE '%@company.com';
```

### **Case Sensitivity in LIKE**

```sql
-- Most databases: LIKE is case-insensitive by default
SELECT * FROM employees WHERE last_name LIKE 'smith';  -- Matches 'Smith'

-- For case-sensitive search:
-- MySQL: Use BINARY keyword
SELECT * FROM employees WHERE BINARY last_name LIKE 'Smith';

-- PostgreSQL: Use ILIKE for case-insensitive, LIKE for case-sensitive
SELECT * FROM employees WHERE last_name ILIKE 'smith';  -- Case-insensitive
SELECT * FROM employees WHERE last_name LIKE 'Smith';   -- Case-sensitive
```

### **IS NULL and IS NOT NULL**

```sql
-- Check for NULL values
SELECT * FROM employees WHERE manager_id IS NULL;

-- Check for non-NULL values
SELECT * FROM employees WHERE manager_id IS NOT NULL;

-- Common mistake: Using = NULL (doesn't work!)
SELECT * FROM employees WHERE manager_id = NULL;  -- WRONG! Always returns empty
```

---

## **2.5 ORDER BY: SORTING RESULTS**

### **Basic Sorting**

```sql
-- Sort by single column (ascending by default)
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary;

-- Explicit ascending order
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary ASC;

-- Descending order
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC;

-- Sort by multiple columns
SELECT first_name, last_name, department_id, salary
FROM employees
ORDER BY department_id ASC, salary DESC;
```

### **Sorting Examples**

```sql
-- Employees by hire date (newest first)
SELECT first_name, last_name, hire_date
FROM employees
ORDER BY hire_date DESC;

-- Departments by budget (highest first)
SELECT name, location, budget
FROM departments
ORDER BY budget DESC;

-- Complex sorting logic
SELECT
    first_name,
    last_name,
    department_id,
    salary,
    CASE
        WHEN salary > 70000 THEN 'High'
        WHEN salary > 50000 THEN 'Medium'
        ELSE 'Low'
    END AS salary_category
FROM employees
ORDER BY
    department_id,
    salary_category,
    last_name;
```

### **Sorting by Column Position**

```sql
-- Sort by column number instead of name
SELECT first_name, last_name, salary
FROM employees
ORDER BY 3 DESC;  -- 3 refers to salary (3rd column in SELECT)

-- Sort by multiple positions
SELECT first_name, last_name, department_id, salary
FROM employees
ORDER BY 3, 4 DESC;  -- department_id, then salary
```

**Note:** While this works, using column names is more maintainable.

### **NULL Values in Sorting**

```sql
-- NULLs typically sort first in ASC order, last in DESC order
SELECT first_name, manager_id
FROM employees
ORDER BY manager_id ASC;  -- NULLs first

-- Control NULL ordering explicitly (some databases)
-- MySQL: NULLS FIRST / NULLS LAST (version 8.0+)
SELECT first_name, manager_id
FROM employees
ORDER BY manager_id ASC NULLS LAST;

-- Workaround for databases without NULLS FIRST/LAST
SELECT first_name, manager_id,
       CASE WHEN manager_id IS NULL THEN 1 ELSE 0 END AS null_flag
FROM employees
ORDER BY null_flag, manager_id ASC;
```

---

## **2.6 LIMIT, OFFSET, and TOP: CONTROLLING RESULT SIZE**

### **LIMIT (MySQL, PostgreSQL, SQLite)**

```sql
-- Get only first N rows
SELECT * FROM employees LIMIT 5;

-- Get top 3 highest paid employees
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC
LIMIT 3;

-- LIMIT with OFFSET (pagination)
SELECT * FROM employees
ORDER BY id
LIMIT 10 OFFSET 20;  -- Skip 20, get next 10 (rows 21-30)
```

### **TOP (SQL Server)**

```sql
-- SQL Server uses TOP instead of LIMIT
SELECT TOP 5 * FROM employees;

-- With ORDER BY
SELECT TOP 3 first_name, last_name, salary
FROM employees
ORDER BY salary DESC;

-- TOP with PERCENT
SELECT TOP 10 PERCENT * FROM employees
ORDER BY salary DESC;
```

### **FETCH FIRST (Standard SQL)**

```sql
-- Standard SQL (works in PostgreSQL, newer MySQL/Oracle)
SELECT * FROM employees
ORDER BY salary DESC
FETCH FIRST 5 ROWS ONLY;

-- With OFFSET
SELECT * FROM employees
ORDER BY id
OFFSET 10 ROWS
FETCH NEXT 5 ROWS ONLY;
```

### **Practical Pagination Examples**

```sql
-- Page 1: Rows 1-10
SELECT * FROM employees
ORDER BY last_name, first_name
LIMIT 10 OFFSET 0;

-- Page 2: Rows 11-20
SELECT * FROM employees
ORDER BY last_name, first_name
LIMIT 10 OFFSET 10;

-- Page 3: Rows 21-30
SELECT * FROM employees
ORDER BY last_name, first_name
LIMIT 10 OFFSET 20;

-- Calculate total pages for UI
SELECT
    COUNT(*) AS total_records,
    CEIL(COUNT(*) / 10.0) AS total_pages
FROM employees;
```

---

## **2.7 DISTINCT: REMOVING DUPLICATES**

### **Basic DISTINCT Usage**

```sql
-- Get unique department IDs
SELECT DISTINCT department_id FROM employees;

-- Get unique combinations of columns
SELECT DISTINCT department_id, manager_id FROM employees;

-- COUNT of distinct values
SELECT COUNT(DISTINCT department_id) AS unique_departments
FROM employees;
```

### **DISTINCT vs GROUP BY**

```sql
-- DISTINCT: Remove duplicates
SELECT DISTINCT department_id FROM employees;

-- GROUP BY: Can also remove duplicates, plus aggregations
SELECT department_id
FROM employees
GROUP BY department_id;

-- With GROUP BY you can add aggregate functions
SELECT
    department_id,
    COUNT(*) AS employee_count,
    AVG(salary) AS avg_salary
FROM employees
GROUP BY department_id;
```

### **DISTINCT with Expressions**

```sql
-- Distinct based on calculated values
SELECT DISTINCT YEAR(hire_date) AS hire_year FROM employees;

-- Distinct concatenated names
SELECT DISTINCT CONCAT(first_name, ' ', last_name) AS full_name
FROM employees;

-- Be careful with NULLs
SELECT DISTINCT manager_id FROM employees;
-- NULL will be included as a distinct value
```

---

## **2.8 CALCULATED COLUMNS AND EXPRESSIONS**

### **Arithmetic Operations**

```sql
-- Basic arithmetic
SELECT
    first_name,
    salary,
    salary * 1.10 AS proposed_salary,
    salary / 12 AS monthly_salary,
    salary + 5000 AS salary_with_bonus,
    salary - (salary * 0.20) AS salary_after_tax
FROM employees;

-- Using parentheses for order of operations
SELECT
    salary,
    salary * 0.10 + 5000 AS bonus_v1,      -- (salary * 0.10) + 5000
    salary * (0.10 + 5000) AS bonus_v2     -- salary * 5000.10 (probably wrong!)
FROM employees;
```

### **String Concatenation**

```sql
-- MySQL: CONCAT() function
SELECT
    CONCAT(first_name, ' ', last_name) AS full_name,
    CONCAT(last_name, ', ', first_name) AS last_first
FROM employees;

-- Standard SQL: || operator (PostgreSQL, Oracle, SQLite)
SELECT
    first_name || ' ' || last_name AS full_name
FROM employees;

-- SQL Server: + operator
SELECT
    first_name + ' ' + last_name AS full_name
FROM employees;

-- With email address
SELECT
    CONCAT(first_name, ' ', last_name, ' <', email, '>') AS contact_info
FROM employees;
```

### **Date and Time Calculations**

```sql
-- Calculate years of service
SELECT
    first_name,
    last_name,
    hire_date,
    DATEDIFF(CURDATE(), hire_date) / 365 AS years_of_service
FROM employees;

-- MySQL date functions
SELECT
    first_name,
    hire_date,
    YEAR(hire_date) AS hire_year,
    MONTH(hire_date) AS hire_month,
    DAY(hire_date) AS hire_day,
    DAYNAME(hire_date) AS hire_day_name
FROM employees;

-- Adding to dates
SELECT
    first_name,
    hire_date,
    DATE_ADD(hire_date, INTERVAL 1 YEAR) AS one_year_anniversary,
    DATE_ADD(hire_date, INTERVAL 90 DAY) AS probation_end_date
FROM employees;
```

### **CASE Statements: Conditional Logic**

```sql
-- Simple CASE statement
SELECT
    first_name,
    salary,
    CASE
        WHEN salary > 70000 THEN 'High'
        WHEN salary > 50000 THEN 'Medium'
        ELSE 'Low'
    END AS salary_level
FROM employees;

-- Complex conditions
SELECT
    first_name,
    last_name,
    department_id,
    CASE
        WHEN department_id = 1 AND salary > 60000 THEN 'Senior Sales'
        WHEN department_id = 1 THEN 'Sales'
        WHEN department_id = 2 AND salary > 70000 THEN 'Lead Engineer'
        WHEN department_id = 2 THEN 'Engineer'
        ELSE 'Other'
    END AS role_description
FROM employees;

-- CASE in ORDER BY
SELECT first_name, last_name, department_id, salary
FROM employees
ORDER BY
    CASE
        WHEN department_id = 1 THEN 1
        WHEN department_id = 2 THEN 2
        ELSE 3
    END,
    salary DESC;
```

---

## **2.9 PUTTING IT ALL TOGETHER: COMPREHENSIVE QUERIES**

### **Complete Query Structure**

```sql
-- All clauses in proper order
SELECT
    column1 AS alias1,
    column2 AS alias2,
    expression AS calculated_column
FROM table_name
WHERE conditions
GROUP BY columns
HAVING group_conditions
ORDER BY sort_columns
LIMIT row_count
OFFSET skip_rows;
```

### **Practical Business Examples**

**Example 1: Employee Directory Report**
```sql
SELECT
    e.first_name AS "First Name",
    e.last_name AS "Last Name",
    CONCAT('$', FORMAT(e.salary, 2)) AS "Annual Salary",
    CONCAT('$', FORMAT(e.salary / 12, 2)) AS "Monthly Salary",
    d.name AS "Department",
    e.hire_date AS "Hire Date",
    CASE
        WHEN DATEDIFF(CURDATE(), e.hire_date) > 365 * 5 THEN '5+ Years'
        WHEN DATEDIFF(CURDATE(), e.hire_date) > 365 * 3 THEN '3-5 Years'
        WHEN DATEDIFF(CURDATE(), e.hire_date) > 365 THEN '1-3 Years'
        ELSE 'Less than 1 Year'
    END AS "Tenure"
FROM employees e
LEFT JOIN departments d ON e.department_id = d.id
WHERE e.salary > 50000
  AND (d.name LIKE '%Sales%' OR d.name LIKE '%Marketing%')
ORDER BY
    d.name,
    e.salary DESC,
    e.last_name
LIMIT 25;
```

**Example 2: Department Budget Analysis**
```sql
SELECT
    d.name AS Department,
    d.location AS Location,
    CONCAT('$', FORMAT(d.budget, 2)) AS Total_Budget,
    COUNT(e.id) AS Employee_Count,
    CONCAT('$', FORMAT(COALESCE(SUM(e.salary), 0), 2)) AS Total_Salary_Cost,
    CONCAT('$', FORMAT(d.budget - COALESCE(SUM(e.salary), 0), 2)) AS Budget_Remaining,
    CONCAT(FORMAT((COALESCE(SUM(e.salary), 0) / d.budget) * 100, 1), '%') AS Salary_Percentage
FROM departments d
LEFT JOIN employees e ON d.id = e.department_id
WHERE d.budget > 0
GROUP BY d.id, d.name, d.location, d.budget
HAVING COUNT(e.id) > 0
ORDER BY Budget_Remaining DESC;
```

**Example 3: Recent Hires Report**
```sql
SELECT
    e.first_name,
    e.last_name,
    e.email,
    e.hire_date,
    d.name AS department_name,
    m.first_name AS manager_first,
    m.last_name AS manager_last,
    CASE
        WHEN DATEDIFF(CURDATE(), e.hire_date) < 90 THEN 'On Probation'
        ELSE 'Confirmed'
    END AS employment_status,
    CASE
        WHEN e.salary < 50000 THEN 'Entry Level'
        WHEN e.salary < 80000 THEN 'Mid Level'
        ELSE 'Senior Level'
    END AS salary_band
FROM employees e
LEFT JOIN departments d ON e.department_id = d.id
LEFT JOIN employees m ON e.manager_id = m.id
WHERE e.hire_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
ORDER BY e.hire_date DESC, e.department_id;
```

---

## **2.10 PERFORMANCE TIPS FOR BASIC QUERIES**

### **Optimizing WHERE Clauses**

```sql
-- ✅ Use indexed columns in WHERE
SELECT * FROM employees WHERE id = 123;  -- id is primary key (indexed)

-- ✅ Filter early to reduce rows
SELECT e.first_name, d.name
FROM employees e
JOIN departments d ON e.department_id = d.id
WHERE e.salary > 70000;  -- Filter employees before join

-- ❌ Avoid functions on indexed columns in WHERE
SELECT * FROM employees WHERE YEAR(hire_date) = 2024;  -- Can't use index
-- ✅ Better:
SELECT * FROM employees WHERE hire_date >= '2024-01-01' AND hire_date < '2025-01-01';

-- ❌ Avoid OR with different columns (can cause full table scan)
SELECT * FROM employees WHERE first_name = 'John' OR salary > 70000;
-- ✅ Better: Use UNION
SELECT * FROM employees WHERE first_name = 'John'
UNION
SELECT * FROM employees WHERE salary > 70000;
```

### **Optimizing SELECT Clauses**

```sql
-- ✅ Specify only needed columns
SELECT first_name, last_name, email FROM employees;

-- ❌ Avoid SELECT * (unless exploring)
SELECT * FROM employees;

-- ✅ Use LIMIT for testing
SELECT * FROM large_table LIMIT 100;

-- ✅ Use EXISTS instead of COUNT() for existence checks
SELECT d.name
FROM departments d
WHERE EXISTS (
    SELECT 1 FROM employees e WHERE e.department_id = d.id
);
```

### **Optimizing ORDER BY and LIMIT**

```sql
-- ✅ Use indexed columns in ORDER BY when possible
SELECT * FROM employees ORDER BY id;  -- id is indexed

-- ❌ ORDER BY on calculated columns is slower
SELECT * FROM employees ORDER BY salary * 1.1;

-- ✅ For pagination, ensure ORDER BY is deterministic
SELECT * FROM employees ORDER BY last_name, first_name, id LIMIT 10 OFFSET 20;

-- ❌ Without unique ordering, pagination can skip/duplicate rows
SELECT * FROM employees ORDER BY salary LIMIT 10 OFFSET 20;
-- Multiple employees might have same salary, causing inconsistency
```

---

## **2.11 COMMON ERRORS AND TROUBLESHOOTING**

### **Syntax Errors**

```sql
-- Missing comma
SELECT first_name last_name FROM employees;  -- ERROR
SELECT first_name, last_name FROM employees; -- CORRECT

-- Missing quotes around strings
SELECT * FROM employees WHERE last_name = Smith;  -- ERROR
SELECT * FROM employees WHERE last_name = 'Smith'; -- CORRECT

-- Wrong operator for NULL
SELECT * FROM employees WHERE manager_id = NULL;  -- WRONG
SELECT * FROM employees WHERE manager_id IS NULL; -- CORRECT
```

### **Logical Errors**

```sql
-- Wrong order of operations
SELECT * FROM employees
WHERE department_id = 1 OR department_id = 2 AND salary > 70000;
-- Might return unexpected results
-- Use parentheses for clarity

-- BETWEEN with dates (inclusive)
SELECT * FROM employees
WHERE hire_date BETWEEN '2024-01-01' AND '2024-01-31';
-- Includes Jan 31 00:00:00, might miss data from Jan 31
-- Better for dates:
WHERE hire_date >= '2024-01-01' AND hire_date < '2024-02-01'
```

### **Performance Issues**

```sql
-- Slow: Function on indexed column
SELECT * FROM employees WHERE UPPER(last_name) = 'SMITH';

-- Faster: If you know the case
SELECT * FROM employees WHERE last_name = 'Smith';

-- Or use database-specific case-insensitive search
SELECT * FROM employees WHERE last_name ILIKE 'smith';  -- PostgreSQL
```

---

## **2.12 PRACTICAL EXERCISES: DATA QUERYING**

### **Exercise Set 1: Basic Filtering**

```sql
-- 1. Find all employees in department 2
SELECT * FROM employees WHERE department_id = 2;

-- 2. Find employees hired after January 1, 2022
SELECT * FROM employees WHERE hire_date > '2022-01-01';

-- 3. Find employees with salary between 50000 and 70000
SELECT * FROM employees WHERE salary BETWEEN 50000 AND 70000;

-- 4. Find employees whose last name starts with 'S'
SELECT * FROM employees WHERE last_name LIKE 'S%';

-- 5. Find employees without a manager (NULL manager_id)
SELECT * FROM employees WHERE manager_id IS NULL;
```

### **Exercise Set 2: Sorting and Limiting**

```sql
-- 1. List employees by salary (highest first)
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC;

-- 2. Get the 5 most recently hired employees
SELECT * FROM employees
ORDER BY hire_date DESC
LIMIT 5;

-- 3. List departments by budget (lowest first)
SELECT name, budget FROM departments ORDER BY budget ASC;

-- 4. Get unique department IDs from employees table
SELECT DISTINCT department_id FROM employees;

-- 5. Page through employees (second page, 10 per page)
SELECT * FROM employees
ORDER BY last_name, first_name
LIMIT 10 OFFSET 10;
```

### **Exercise Set 3: Complex Queries**

```sql
-- 1. Create an employee contact list with formatted names
SELECT
    CONCAT(last_name, ', ', first_name) AS full_name,
    email,
    CONCAT('(', SUBSTRING(phone, 1, 3), ') ',
           SUBSTRING(phone, 4, 3), '-',
           SUBSTRING(phone, 7, 4)) AS formatted_phone
FROM employees
WHERE phone IS NOT NULL;

-- 2. Calculate bonus amounts (10% of salary for sales, 5% for others)
SELECT
    first_name,
    last_name,
    department_id,
    salary,
    CASE
        WHEN department_id = 1 THEN salary * 0.10
        ELSE salary * 0.05
    END AS bonus_amount
FROM employees;

-- 3. Find employees eligible for promotion (5+ years, salary < 80000)
SELECT
    first_name,
    last_name,
    hire_date,
    salary,
    DATEDIFF(CURDATE(), hire_date) / 365 AS years_of_service
FROM employees
WHERE DATEDIFF(CURDATE(), hire_date) / 365 >= 5
  AND salary < 80000
ORDER BY years_of_service DESC;
```

### **Exercise Set 4: Error Finding**

```sql
-- Identify and fix the errors in these queries:

-- 1. Syntax error
SELECT first_name last name FROM employees WHERE salary > 50000;

-- 2. Logical error
SELECT * FROM employees WHERE hire_date BETWEEN '2023' AND '2024';

-- 3. Performance issue
SELECT * FROM employees WHERE YEAR(hire_date) = 2023 ORDER BY hire_date;

-- 4. NULL handling error
SELECT * FROM employees WHERE manager_id = NULL;

-- 5. Pagination issue
SELECT * FROM employees ORDER BY salary LIMIT 10 OFFSET 20;
```

---

## **2.13 KEY TAKEAWAYS & NEXT STEPS**

### **What You've Mastered in Part 2:**

1. ✅ **SELECT statements** - Retrieving specific data
2. ✅ **Column aliases** - Making results readable
3. ✅ **WHERE clause** - Filtering with precision
4. ✅ **Comparison operators** - =, <>, >, <, >=, <=
5. ✅ **Logical operators** - AND, OR, NOT with parentheses
6. ✅ **Special operators** - IN, BETWEEN, LIKE, IS NULL
7. ✅ **ORDER BY** - Sorting results ascending/descending
8. ✅ **LIMIT/OFFSET** - Controlling result size and pagination
9. ✅ **DISTINCT** - Removing duplicate values
10. ✅ **Calculated columns** - Arithmetic, strings, dates, CASE
11. ✅ **Performance optimization** - Writing efficient queries

### **Essential Patterns Learned:**

```sql
-- Basic query pattern
SELECT columns
FROM table
WHERE conditions
ORDER BY sort_columns
LIMIT row_count;

-- Filtering patterns
WHERE column = value
WHERE column IN (list)
WHERE column BETWEEN low AND high
WHERE column LIKE 'pattern%'
WHERE column IS NULL

-- Sorting patterns
ORDER BY column1 ASC, column2 DESC
ORDER BY CASE WHEN ... THEN ... END

-- Calculated columns
column * 1.10 AS increased_value
CONCAT(first, ' ', last) AS full_name
CASE WHEN condition THEN result END AS category
```

### **Common Pitfalls to Avoid:**

1. **Forgetting single quotes** around string values
2. **Using = NULL** instead of IS NULL
3. **Missing parentheses** with AND/OR combinations
4. **SELECT *** in production code
5. **No ORDER BY** with LIMIT/OFFSET pagination
6. **Functions on indexed columns** in WHERE clauses

### **Preparation for Part 3:**

Before moving to Part 3 (Aggregation), ensure you can:
- Write complex WHERE conditions with multiple filters
- Sort results by multiple criteria
- Use calculated columns effectively
- Implement pagination with LIMIT/OFFSET
- Format query output for readability

### **Recommended Practice:**

```sql
-- Create and query a practice table
CREATE TABLE practice_orders (
    order_id INT PRIMARY KEY AUTO_INCREMENT,
    customer_name VARCHAR(100),
    order_date DATE,
    amount DECIMAL(10,2),
    status VARCHAR(20),
    region VARCHAR(50)
);

INSERT INTO practice_orders VALUES
(1, 'John Smith', '2024-01-15', 250.00, 'Completed', 'North'),
(2, 'Sarah Johnson', '2024-01-16', 150.50, 'Pending', 'South'),
(3, 'Mike Brown', '2024-01-14', 500.00, 'Completed', 'North'),
(4, 'Lisa Davis', '2024-01-17', 75.25, 'Cancelled', 'West'),
(5, 'Tom Wilson', '2024-01-15', 300.00, 'Completed', 'South');

-- Practice queries:
-- 1. Find all completed orders
-- 2. Get orders over $200 from North region
-- 3. List unique regions
-- 4. Sort by amount (highest first), then date
-- 5. Calculate 10% tax for each order
-- 6. Format customer names as "Last, First"
```

---

## **QUICK REFERENCE: PART 2 COMMANDS**

### **Query Clauses Reference:**

| Clause | Purpose | Example |
|--------|---------|---------|
| `SELECT` | Specify columns | `SELECT col1, col2` |
| `AS` | Column alias | `SELECT col AS name` |
| `FROM` | Specify table | `FROM table_name` |
| `WHERE` | Filter rows | `WHERE condition` |
| `ORDER BY` | Sort results | `ORDER BY col DESC` |
| `LIMIT` | Restrict rows | `LIMIT 10` |
| `OFFSET` | Skip rows | `OFFSET 20` |
| `DISTINCT` | Unique values | `SELECT DISTINCT col` |

### **Operator Reference:**

| Operator | Description | Example |
|----------|-------------|---------|
| `=` | Equal | `col = 'value'` |
| `<>`, `!=` | Not equal | `col <> 'value'` |
| `>`, `<` | Greater/Less | `col > 100` |
| `>=`, `<=` | Greater/Less or equal | `col >= 100` |
| `AND` | All true | `cond1 AND cond2` |
| `OR` | Any true | `cond1 OR cond2` |
| `NOT` | Negate | `NOT condition` |
| `IN` | In list | `col IN (1,2,3)` |
| `BETWEEN` | In range | `col BETWEEN 1 AND 10` |
| `LIKE` | Pattern match | `col LIKE 'A%'` |
| `IS NULL` | Is NULL | `col IS NULL` |

### **Pattern Matching:**

- `%` - Any sequence of characters
- `_` - Any single character
- `[abc]` - Any single character a, b, or c
- `[^abc]` - Any single character not a, b, or c
- `[a-z]` - Any single character in range

---

**Ready for Part 3?** Next, we'll master **Aggregation Functions** with GROUP BY, HAVING, and learn to summarize data like a pro!

---

*End of Part 2: Data Querying Fundamentals*